# Pandas 笔记

- Pandas是数据操纵和分析软件包。
    - import pandas as pd
    
### Pandas 包括：Pandas Series 和 Pandas DataFrame 两种数据结构


# Panda Series 是类似一维数组的对象

In [1]:
import pandas as pd

In [22]:
ser = pd.Series(data=[20,30,2,'yes','no'], index=['apples','milk','eggs','l','other'])
print(ser)
print(ser.shape)
print(ser.ndim)#维度
print(ser.size)
print(ser.values)
print(ser.index)
print('banana' in ser)

apples     20
milk       30
eggs        2
l         yes
other      no
dtype: object
(5,)
1
5
[20 30 2 'yes' 'no']
Index(['apples', 'milk', 'eggs', 'l', 'other'], dtype='object')
False

In [28]:
# .loc 和 .iloc 分别代表用k值还是用数字索引 
print(ser.loc['apples'])
print(ser['apples'])

print(ser[['apples','milk']])

print(ser.iloc[[0,1]])
print(ser[[0,1]])

20
20
apples    20
milk      30
dtype: object
apples    20
milk      30
dtype: object
apples    20
milk      30
dtype: object

In [46]:
ser['apples'] = 100 # 改
ser

milk       30
eggs        2
other      no
apples    100
dtype: object

In [51]:
#  inplace=True 从源列表中删除
s = ser.drop('milk', inplace=True)
print(s)
print(ser)

None
eggs        2
other      no
apples    100
dtype: object

In [52]:
ser.pop('other')
ser

eggs        2
apples    100
dtype: object

In [57]:
ser['nihao']=30
ser['kkk']='ok'
ser

eggs        2
apples    100
nihao      30
kkk        ok
dtype: object

In [69]:
ser2 = pd.Series([20,30,10,80],['kk','dd','hh','ww'])
ser2

kk    20
dd    30
hh    10
ww    80
dtype: int64

In [70]:
ser2 = ser2 / 2 * 3 + 1 - 5
ser2

kk     26.0
dd     41.0
hh     11.0
ww    116.0
dtype: float64

In [71]:
import numpy as np

# np.exp(ser2)
# np.pow(ser2,2)
ser2 = np.sqrt(ser2)
ser2

kk     5.099020
dd     6.403124
hh     3.316625
ww    10.770330
dtype: float64

In [75]:
ser2[['kk','dd']] * 2

kk    10.198039
dd    12.806248
dtype: float64

In [80]:
import pandas as pd

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

dist_planets = pd.Series(data=distance_from_sun, index=planets)

# 计算太阳光到达每个星球所需的分钟数。 你可以通过将每个行星与太阳的距离除以光速来实现。
# 由于在上面的数据中，与太阳的距离以10 ^ 6 km为单位，因此光可以使用c = 18的光速值，因为光传播的速度为18 x 10 ^ 6 km / min。
time_light = dist_planets / 18 
# 使用布尔索引仅选择那些阳光需要不到40分钟才能到达的行星。
close_planets = time_light[time_light < 40]
print(time_light)
print(close_planets)

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64
Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

# Panda DataFrame 
### 是具有带标签的行和列的二维数据结构，可以存储多种数据类型。类似Excel

## 手动创建1
- 先创建字典
- 用pd.Series()创建字典的每一条数据
- 用pd.DataFrame(dict)创建一个DataFrame数据表

In [83]:
adict = {
    'bob': pd.Series(data=[245, 25, 55], index=['bike', 'pants', 'watch']),
    'alice': pd.Series(data=[40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])
}
type(adict)

dict

In [84]:
shoppingcars = pd.DataFrame(adict)
shoppingcars

           bob  alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [86]:
adict2 = {
    'Bob': pd.Series(data=[245,25,55]),
    'Alice': pd.Series(data=[40,110,500,45])
}
spc = pd.DataFrame(adict2)
spc

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [91]:
print(shoppingcars.shape)
print(shoppingcars.ndim)
print(shoppingcars.size)
print(shoppingcars.index)
print(shoppingcars.columns)
print(shoppingcars.values)

(5, 2)
2
10
Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')
Index(['bob', 'alice'], dtype='object')
[[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

In [95]:
bob_spc = pd.DataFrame(shoppingcars,columns=['bob'])
bob_spc

           bob
bike     245.0
book       NaN
glasses    NaN
pants     25.0
watch     55.0

In [96]:
sel = pd.DataFrame(shoppingcars, index=['pants','book'])
sel

        bob  alice
pants  25.0   45.0
book    NaN   40.0

In [97]:
alice_spc = pd.DataFrame(shoppingcars, columns=['alice'], index=['pants','bike'])
alice_spc

       alice
pants   45.0
bike   500.0

## 手动创建2
- 先创建普通字典
- 用pd.DataFrame(dict)创建一个DataFrame数据表

In [103]:
data = {
    'int':[1,2,3,4],
    'float':[1.1, 2.1, 3.1, 4.1]
}
df = pd.DataFrame(data)
df

   int  float
0    1    1.1
1    2    2.1
2    3    3.1
3    4    4.1

In [104]:
df.index = ['label 1','label 2','label 3','label 4']
df

         int  float
label 1    1    1.1
label 2    2    2.1
label 3    3    3.1
label 4    4    4.1

## 手动创建3
- 先创建列表
- 每个元素为字典
- 用pd.DataFrame(dict)创建一个DataFrame数据表

In [111]:
alist = [
    {'bike': 20, 'watch': 100, 'pants': 120,},
    {'watch': 10, 'glasses': 11, 'pants': 120, 'bike':20},
    {'watch': 45, 'glasses': 22, 'pants': 12, 'kk':18}

]
sti = pd.DataFrame(alist)
sti

   bike  glasses    kk  pants  watch
0  20.0      NaN   NaN    120    100
1  20.0     11.0   NaN    120     10
2   NaN     22.0  18.0     12     45

In [113]:
sti.index = ['store 1', 'store 2',  'store 3']
sti

         bike  glasses    kk  pants  watch
store 1  20.0      NaN   NaN    120    100
store 2  20.0     11.0   NaN    120     10
store 3   NaN     22.0  18.0     12     45

## 访问DataFrame元素
### dataframe[column][row]

In [107]:
sti[['bike','pants']]

         bike  pants
store 1    20    120
store 2    20    120

In [114]:
sti['bike'][['store 1','store 2']]

store 1    20.0
store 2    20.0
Name: bike, dtype: float64